SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_semailbox.h
/* Bit fields for SEMAILBOX TX_PROT */
#define _SEMAILBOX_TX_PROT_RESETVALUE           0x00000000UL                            /**< Default value for SEMAILBOX_TX_PROT         */
#define _SEMAILBOX_TX_PROT_MASK                 0xFFE00000UL                            /**< Mask for SEMAILBOX_TX_PROT                  */
#define SEMAILBOX_TX_PROT_UNPROTECTED           (0x1UL << 21)                           /**< UNPROTECTED                                 */
#define _SEMAILBOX_TX_PROT_UNPROTECTED_SHIFT    21                                      /**< Shift value for SEMAILBOX_UNPROTECTED       */
#define _SEMAILBOX_TX_PROT_UNPROTECTED_MASK     0x200000UL                              /**< Bit mask for SEMAILBOX_UNPROTECTED          */
#define _SEMAILBOX_TX_PROT_UNPROTECTED_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_TX_PROT          */
#define SEMAILBOX_TX_PROT_UNPROTECTED_DEFAULT   (_SEMAILBOX_TX_PROT_UNPROTECTED_DEFAULT << 21) /**< Shifted mode DEFAULT for SEMAILBOX_TX_PROT  */
#define SEMAILBOX_TX_PROT_PRIVILEGED            (0x1UL << 22)                           /**< PRIVILEGED                                  */
#define _SEMAILBOX_TX_PROT_PRIVILEGED_SHIFT     22                                      /**< Shift value for SEMAILBOX_PRIVILEGED        */
#define _SEMAILBOX_TX_PROT_PRIVILEGED_MASK      0x400000UL                              /**< Bit mask for SEMAILBOX_PRIVILEGED           */
#define _SEMAILBOX_TX_PROT_PRIVILEGED_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_TX_PROT          */
#define SEMAILBOX_TX_PROT_PRIVILEGED_DEFAULT    (_SEMAILBOX_TX_PROT_PRIVILEGED_DEFAULT << 22) /**< Shifted mode DEFAULT for SEMAILBOX_TX_PROT  */
#define SEMAILBOX_TX_PROT_NONSECURE             (0x1UL << 23)                           /**< NONSECURE                                   */
#define _SEMAILBOX_TX_PROT_NONSECURE_SHIFT      23                                      /**< Shift value for SEMAILBOX_NONSECURE         */
#define _SEMAILBOX_TX_PROT_NONSECURE_MASK       0x800000UL                              /**< Bit mask for SEMAILBOX_NONSECURE            */
#define _SEMAILBOX_TX_PROT_NONSECURE_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_TX_PROT          */
#define SEMAILBOX_TX_PROT_NONSECURE_DEFAULT     (_SEMAILBOX_TX_PROT_NONSECURE_DEFAULT << 23) /**< Shifted mode DEFAULT for SEMAILBOX_TX_PROT  */
#define _SEMAILBOX_TX_PROT_USER_SHIFT           24                                      /**< Shift value for SEMAILBOX_USER              */
#define _SEMAILBOX_TX_PROT_USER_MASK            0xFF000000UL                            /**< Bit mask for SEMAILBOX_USER                 */
#define _SEMAILBOX_TX_PROT_USER_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_TX_PROT          */
#define SEMAILBOX_TX_PROT_USER_DEFAULT          (_SEMAILBOX_TX_PROT_USER_DEFAULT << 24) /**< Shifted mode DEFAULT for SEMAILBOX_TX_PROT  */

/* Bit fields for SEMAILBOX RX_PROT */
#define _SEMAILBOX_RX_PROT_RESETVALUE           0x00000000UL                            /**< Default value for SEMAILBOX_RX_PROT         */
#define _SEMAILBOX_RX_PROT_MASK                 0xFFE00000UL                            /**< Mask for SEMAILBOX_RX_PROT                  */
#define SEMAILBOX_RX_PROT_UNPROTECTED           (0x1UL << 21)                           /**< UNPROTECTED                                 */
#define _SEMAILBOX_RX_PROT_UNPROTECTED_SHIFT    21                                      /**< Shift value for SEMAILBOX_UNPROTECTED       */
#define _SEMAILBOX_RX_PROT_UNPROTECTED_MASK     0x200000UL                              /**< Bit mask for SEMAILBOX_UNPROTECTED          */
#define _SEMAILBOX_RX_PROT_UNPROTECTED_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_RX_PROT          */
#define SEMAILBOX_RX_PROT_UNPROTECTED_DEFAULT   (_SEMAILBOX_RX_PROT_UNPROTECTED_DEFAULT << 21) /**< Shifted mode DEFAULT for SEMAILBOX_RX_PROT  */
#define SEMAILBOX_RX_PROT_PRIVILEGED            (0x1UL << 22)                           /**< PRIVILEGED                                  */
#define _SEMAILBOX_RX_PROT_PRIVILEGED_SHIFT     22                                      /**< Shift value for SEMAILBOX_PRIVILEGED        */
#define _SEMAILBOX_RX_PROT_PRIVILEGED_MASK      0x400000UL                              /**< Bit mask for SEMAILBOX_PRIVILEGED           */
#define _SEMAILBOX_RX_PROT_PRIVILEGED_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_RX_PROT          */
#define SEMAILBOX_RX_PROT_PRIVILEGED_DEFAULT    (_SEMAILBOX_RX_PROT_PRIVILEGED_DEFAULT << 22) /**< Shifted mode DEFAULT for SEMAILBOX_RX_PROT  */
#define SEMAILBOX_RX_PROT_NONSECURE             (0x1UL << 23)                           /**< NONSECURE                                   */
#define _SEMAILBOX_RX_PROT_NONSECURE_SHIFT      23                                      /**< Shift value for SEMAILBOX_NONSECURE         */
#define _SEMAILBOX_RX_PROT_NONSECURE_MASK       0x800000UL                              /**< Bit mask for SEMAILBOX_NONSECURE            */
#define _SEMAILBOX_RX_PROT_NONSECURE_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_RX_PROT          */
#define SEMAILBOX_RX_PROT_NONSECURE_DEFAULT     (_SEMAILBOX_RX_PROT_NONSECURE_DEFAULT << 23) /**< Shifted mode DEFAULT for SEMAILBOX_RX_PROT  */
#define _SEMAILBOX_RX_PROT_USER_SHIFT           24                                      /**< Shift value for SEMAILBOX_USER              */
#define _SEMAILBOX_RX_PROT_USER_MASK            0xFF000000UL                            /**< Bit mask for SEMAILBOX_USER                 */
#define _SEMAILBOX_RX_PROT_USER_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_RX_PROT          */
#define SEMAILBOX_RX_PROT_USER_DEFAULT          (_SEMAILBOX_RX_PROT_USER_DEFAULT << 24) /**< Shifted mode DEFAULT for SEMAILBOX_RX_PROT  */

/* Bit fields for SEMAILBOX TX_HEADER */
#define _SEMAILBOX_TX_HEADER_RESETVALUE         0x00000000UL                            /**< Default value for SEMAILBOX_TX_HEADER       */
#define _SEMAILBOX_TX_HEADER_MASK               0xFFFFFFFFUL                            /**< Mask for SEMAILBOX_TX_HEADER                */
#define _SEMAILBOX_TX_HEADER_TXHEADER_SHIFT     0                                       /**< Shift value for SEMAILBOX_TXHEADER          */
#define _SEMAILBOX_TX_HEADER_TXHEADER_MASK      0xFFFFFFFFUL                            /**< Bit mask for SEMAILBOX_TXHEADER             */
#define _SEMAILBOX_TX_HEADER_TXHEADER_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_TX_HEADER        */
#define SEMAILBOX_TX_HEADER_TXHEADER_DEFAULT    (_SEMAILBOX_TX_HEADER_TXHEADER_DEFAULT << 0) /**< Shifted mode DEFAULT for SEMAILBOX_TX_HEADER*/

/* Bit fields for SEMAILBOX RX_HEADER */
#define _SEMAILBOX_RX_HEADER_RESETVALUE         0x00000000UL                            /**< Default value for SEMAILBOX_RX_HEADER       */
#define _SEMAILBOX_RX_HEADER_MASK               0xFFFFFFFFUL                            /**< Mask for SEMAILBOX_RX_HEADER                */
#define _SEMAILBOX_RX_HEADER_RXHEADER_SHIFT     0                                       /**< Shift value for SEMAILBOX_RXHEADER          */
#define _SEMAILBOX_RX_HEADER_RXHEADER_MASK      0xFFFFFFFFUL                            /**< Bit mask for SEMAILBOX_RXHEADER             */
#define _SEMAILBOX_RX_HEADER_RXHEADER_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_RX_HEADER        */
#define SEMAILBOX_RX_HEADER_RXHEADER_DEFAULT    (_SEMAILBOX_RX_HEADER_RXHEADER_DEFAULT << 0) /**< Shifted mode DEFAULT for SEMAILBOX_RX_HEADER*/

/* Bit fields for SEMAILBOX CONFIGURATION */
#define _SEMAILBOX_CONFIGURATION_RESETVALUE     0x00000000UL                            /**< Default value for SEMAILBOX_CONFIGURATION   */
#define _SEMAILBOX_CONFIGURATION_MASK           0x00000003UL                            /**< Mask for SEMAILBOX_CONFIGURATION            */
#define SEMAILBOX_CONFIGURATION_TXINTEN         (0x1UL << 0)                            /**< TXINTEN                                     */
#define _SEMAILBOX_CONFIGURATION_TXINTEN_SHIFT  0                                       /**< Shift value for SEMAILBOX_TXINTEN           */
#define _SEMAILBOX_CONFIGURATION_TXINTEN_MASK   0x1UL                                   /**< Bit mask for SEMAILBOX_TXINTEN              */
#define _SEMAILBOX_CONFIGURATION_TXINTEN_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_CONFIGURATION    */
#define SEMAILBOX_CONFIGURATION_TXINTEN_DEFAULT (_SEMAILBOX_CONFIGURATION_TXINTEN_DEFAULT << 0) /**< Shifted mode DEFAULT for SEMAILBOX_CONFIGURATION*/
#define SEMAILBOX_CONFIGURATION_RXINTEN         (0x1UL << 1)                            /**< RXINTEN                                     */
#define _SEMAILBOX_CONFIGURATION_RXINTEN_SHIFT  1                                       /**< Shift value for SEMAILBOX_RXINTEN           */
#define _SEMAILBOX_CONFIGURATION_RXINTEN_MASK   0x2UL                                   /**< Bit mask for SEMAILBOX_RXINTEN              */
#define _SEMAILBOX_CONFIGURATION_RXINTEN_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for SEMAILBOX_CONFIGURATION    */
#define SEMAILBOX_CONFIGURATION_RXINTEN_DEFAULT (_SEMAILBOX_CONFIGURATION_RXINTEN_DEFAULT << 1) /**< Shifted mode DEFAULT for SEMAILBOX_CONFIGURATION*/

/** @} End of group EFM32PG28_SEMAILBOX_HOST_BitFields */
/** @} End of group EFM32PG28_SEMAILBOX_HOST */
/**************************************************************************//**
 * @defgroup EFM32PG28_SEMAILBOX_APBSE SEMAILBOX_APBSE
 * @{
 * @brief EFM32PG28 SEMAILBOX_APBSE Register Declaration.
 *****************************************************************************/

/** SEMAILBOX_APBSE Register Declaration. */
typedef struct
{
  __IOM uint32_t             SE_ESECURE_MAILBOX_FIFO;/**< ESECURE_MAILBOX_FIFO                               */
        uint32_t             RESERVED0[15U];         /**< Reserved for future use                            */
  __IM  uint32_t             SE_ESECURE_MAILBOX_TXSTAT;/**< ESECURE_MAILBOX_TXSTAT                             */
  __IM  uint32_t             SE_ESECURE_MAILBOX_RXSTAT;/**< ESECURE_MAILBOX_RXSTAT                             */
  __IM  uint32_t             SE_ESECURE_MAILBOX_TXPROTECT;/**< ESECURE_MAILBOX_TXPROTECT                          */
  __IM  uint32_t             SE_ESECURE_MAILBOX_RXPROTECT;/**< ESECURE_MAILBOX_RXPROTECT                          */
  __IOM uint32_t             SE_ESECURE_MAILBOX_TXHEADER;/**< ESECURE_MAILBOX_TXHEADER                           */
  __IM  uint32_t             SE_ESECURE_MAILBOX_RXHEADER;/**< ESECURE_MAILBOX_RXHEADER                           */
  __IOM uint32_t             SE_ESECURE_MAILBOX_CONFIG;/**< ESECURE_MAILBOX_CONFIG                             */
} SEMAILBOX_APBSE_TypeDef;
/** @} End of group EFM32PG28_SEMAILBOX_APBSE */

/**************************************************************************//**
 * @addtogroup EFM32PG28_SEMAILBOX_APBSE
 * @{
 * @defgroup EFM32PG28_SEMAILBOX_APBSE_BitFields SEMAILBOX_APBSE Bit Fields
 * @{
 *****************************************************************************/

